multi_website/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-13 Wed 14:51 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>NAT Traversal</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Joren Van Onder">
<meta name="description" content="NAT traversal"
>
<link rel="stylesheet" type="text/css" href="/notes/revisioned/assets/style-71440a4164.css"/>
<link rel="icon" href="/notes/revisioned/assets/favicon-034aad3767.png" type="image/x-icon"/>
</head>
<body>
<div id="preamble" class="status">

<div class="top">
  <a href="/notes/">notes</a> / multi website
  <div class="contact">
      github:&nbsp;<a href="https://github.com/jorenvo">jorenvo</a> |
      email:&nbsp;<a href="mailto:joren@jvo.sh">joren@jvo.sh</a> |
      PGP:&nbsp;<a href="/publickey.txt">50A5 7A39 0DE1 1A6C</a> |
      keybase:&nbsp;<a href="https://keybase.io/jvo">jvo</a>
  </div>
</div>
</div>
<div id="content">
<header>
<h1 class="title">NAT Traversal</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb3331a0">1. Multi-website</a>
<ul>
<li><a href="#orgf4acccd">1.1. Basics</a>
<ul>
<li><a href="#orgfaa7a00">1.1.1. Session</a></li>
<li><a href="#orgaa25a55">1.1.2. Request</a></li>
<li><a href="#org6a2bbe3">1.1.3. Assets</a></li>
<li><a href="#org4366928">1.1.4. Themes</a></li>
</ul>
</li>
<li><a href="#org81064f5">1.2. Website Selection</a>
<ul>
<li><a href="#orgf189a54">1.2.1. Forced</a></li>
<li><a href="#org2189d0d">1.2.2. Normal</a></li>
</ul>
</li>
<li><a href="#orgae7789a">1.3. Copy-on-write (COW)</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-orgb3331a0" class="outline-2">
<h2 id="orgb3331a0"><span class="section-number-2">1</span> Multi-website</h2>
<div class="outline-text-2" id="text-1">
<p>
The goal of this document is to give a thorough technical understanding of the standard multi-website feature in &gt;=12. I will be focusing on v12 in this document, but everything should be applicable to v13 as well.
</p>
</div>

<div id="outline-container-orgf4acccd" class="outline-3">
<h3 id="orgf4acccd"><span class="section-number-3">1.1</span> Basics</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgfaa7a00" class="outline-4">
<h4 id="orgfaa7a00"><span class="section-number-4">1.1.1</span> Session</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Sessions are based on <a href="https://werkzeug.palletsprojects.com/en/0.16.x/contrib/sessions/">Werkzeug sessions</a>. When a user visits Odoo a session cookie is created and stored in their browser. It's a unique ID that links every requests that browser makes to a session in Odoo. The session is persistent and is written to disk (by default <code>~/.local/share/Odoo/sessions/</code>). This contains data that needs to persist (e.g. whether or not the user is logged in). The session files are pickled, if you want to inspect them use:
</p>

<pre class="example">
$ python3 -m pickle ~/.local/share/Odoo/sessions/werkzeug_861d25cbe84e9841b907cad27bcca6dae543400d.sess
</pre>

<p>
Stale sessions are automatically removed. A session is considered stale if it hasn't been modified for one week. The expiration date for the cookie on the browser side is 3 months. This is why after 3 months you need to login again.
</p>
</div>

<ol class="org-ol">
<li><a id="orge1b4c8f"></a>Tangent: whether a user is logged in<br>
<div class="outline-text-5" id="text-1-1-1-1">
<p>
Determined by the session token:
</p>

<p>
def _compute_session_token(self, sid)
</p>

<p>
Encrypts <code>{'id', 'login', 'password', 'active'}</code> and the db secret. The result is stored in the session. What's in the session is compared to this to determine when to invalidate (e.g. when a user is set to inactive).
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgaa25a55" class="outline-4">
<h4 id="orgaa25a55"><span class="section-number-4">1.1.2</span> Request</h4>
</div>
<div id="outline-container-org6a2bbe3" class="outline-4">
<h4 id="org6a2bbe3"><span class="section-number-4">1.1.3</span> Assets</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
JS and SCSS assets in Odoo are compiled, minimized and combined into asset bundles. In the case of SCSS it's a necessary step; it needs to be compiled to CSS for the browser to understand. But this is not the only reason, reducing the number of files the browser needs to load also reduces the amount of HTTP requests. On top of that the minimization reduces the filesize which speeds up each HTTP request. To skip the minimization and bundling you can use <code>?debug=assets</code>. It's useful when working on the frontend and also demonstrates how much faster the asset bundling process makes Odoo.
</p>

<p>
Each bundle is a single file, saved as an <code>ir.attachment</code> record. You can find them like this:
</p>

<pre class="example">
SELECT id, url
FROM ir_attachment
WHERE name LIKE '/web/content%'
ORDER BY id;
</pre>

<p>
New bundles are defined in templates as regular QWEB templates and called in the appropriate locations as follows:
</p>

<pre class="example">
&lt;t t-call-assets="web.assets_common"...
</pre>

<p>
This leads to <code>_get_asset_nodes</code> being called which eventually calls <code>get_asset_bundle</code>. This creates objects that inherit from <code>AssetsBundle</code> (like <code>JavascriptAsset</code> and <code>StylesheetAsset</code>). The unique key of the asset is computed in the <code>checksum</code> property and is a hash of:
</p>

<ul class="org-ul">
<li>the metadata of the files (filename, type, url, &#x2026;) it contains, and</li>
<li>the last time a file in the asset bundle was modified</li>
</ul>

<p>
This causes recompilation of an asset bundle when a file in it changes or new files are added. This checksum is saved in the URL of the <code>ir.attachment</code> and looks like this:
</p>

<p>
<code>/web/content/1002-0d0afe0/web.assets_common.js</code>
</p>

<dl class="org-dl">
<dt><code>1002</code></dt><dd>the <code>ir.attachment</code> ID</dd>
<dt><code>0d0afe0</code></dt><dd>the first 7 characters of the <code>checksum</code></dd>
</dl>

<p>
This leads to issues with &gt;1 website, because every website will have it's own assets. To avoid the assets constantly recompiling the <code>website</code> module adds the website ID to the URL:
</p>

<p>
<code>/web/content/1012-0d0afe0/2/web.assets_common.0.js</code>
</p>

<dl class="org-dl">
<dt><code>2</code></dt><dd>the website ID</dd>
</dl>

<p>
This allows Odoo to maintain separate compiled asset bundles per website.
</p>
</div>
</div>
<div id="outline-container-org4366928" class="outline-4">
<h4 id="org4366928"><span class="section-number-4">1.1.4</span> Themes</h4>
</div>
</div>

<div id="outline-container-org81064f5" class="outline-3">
<h3 id="org81064f5"><span class="section-number-3">1.2</span> Website Selection</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf189a54" class="outline-4">
<h4 id="orgf189a54"><span class="section-number-4">1.2.1</span> Forced</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
You can force Odoo to load a specific website ID with a GET parameter, like is done by the website switcher:
</p>

<pre class="example">
?fw=2
</pre>

<p>
This is set on the session, so it will persist for as long as the user is logged in.
</p>
</div>
</div>
<div id="outline-container-org2189d0d" class="outline-4">
<h4 id="org2189d0d"><span class="section-number-4">1.2.2</span> Normal</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
To figure out what website you're on always use <code>self.env["website"].get_current_website()</code>. There's a lot of cases that are handled by it (fw= overrides, geoip, domain names, &#x2026;).
</p>
</div>
</div>
</div>

<div id="outline-container-orgae7789a" class="outline-3">
<h3 id="orgae7789a"><span class="section-number-3">1.3</span> Copy-on-write (COW)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The simplest way to implement multiple websites is to create specific views for each website. But this has multiple issues.
</p>

<p>
First of all, it complicates module upgrades and thus migrations. What do we do when a bugfix in a view was merged? The module upgrade mechanism would need to duplicate this view write to the copied views. This is further complicated by the fact that <code>web_editor</code> modifies the views themselves, it doesn't create inherited views like Studio. So this bugfix can not blindly be applied to copied views when a module is upgraded because customizations would be lost.
</p>

<p>
Second of all, how do we ensure that newly created websites contain the default pages (e.g. contact us)?
</p>

<p>
To avoid these issues a <a href="https://en.wikipedia.org/wiki/Copy-on-write">copy-on-write</a> mechanism was implemented. It defers duplicating views until necessary. Views are created without a <code>website_id</code> and rendered as usual. When a user modifies it a website specific copy is created with the appropriate <code>website_id</code> and the same <code>key</code>. This only happens for writes that happen via the frontend (not in /web). With this mechanism bugfixes to non-edited views are applied as usual and newly created websites will contain all the necessary views.
</p>

<p>
From a technical POV this is mostly implemented in the <code>write</code> of <code>ir.ui.view</code> in the website module, note that it will also handle:
</p>

<ul class="org-ul">
<li>creating website-specific inherited views if they exist,</li>
<li>creating website-specific inactive views (TODO options website),</li>
<li>creating website-specific pages for these views,</li>
</ul>

<p>
Also this way new websites contain default views.
</p>

<p>
Copy-on-write is implemented on the following models:
</p>
<ul class="org-ul">
<li><code>ir.ui.view</code></li>
</ul>

<p>
<code>ir.ui.menu</code> is always copied, generic one is created if it's part of the main menu.
</p>

<p>
TODO website specific <code>website.published.mixin</code>, <code>website.multi.mixin</code>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p><p class="author">Author: Joren Van Onder</p>
</div>
</body>
</html>
